package com.liyafeng.algorithm;

public class N15_FindKToTail {

    /**
     *
     * 代码的健壮性
     * 你写的代码有健壮性，才能拿到offer
     * ============================
     *
     * 找到链表中的倒数第k个节点
     *
     * 1 2 3 6 8 5 4
     * 倒数第3个为 8
     * 从第index = 2个开始第一个指针开始移动，知道第二个指针走到最后
     *
     *
     *
     * 用两个指针，初始都指向头节点，然后一个开始遍历
     * 当遍历到第k+1个的时候
     *
     * ============================
     * 考虑 k 为<1 的情况
     * 考虑链表长度小于k的情况
     * 考虑 链表为null的情况
     *
     *
     * =========================
     * 其实这个也可以用递归
     * 递归到底，然后向上遍历，计数器到k就返回当前节点
     *
     * =========================
     * 指针是个好东西！
     *
     * @param args
     */
    public static void main(String[] args) {

    }
}
