package com.liyafeng.algorithm;

public class N31_MaxSumInArray {

    /**
     * 求一个整型数组中和子数组和的最大值（数组中允许有负数）
     * ==========================
     * 举例分析法，这个最好举个简单的例子，算一算，然后从中就可以找出最大子数组的规律
     * ====================
     *
     *
     * start指针，指向第一个数，直到遇到负数，移动指针到负数的下一个数
     * end一直加，记录最大的正数，和index
     *
     * 那么这个子数组的范围就是start，end
     *
     * ====================================
     * 举例分析总结，就是动态规划，用公式来表示答案，用循环或者递归来实现动态规划
     * 动态规划就是这一个的解和前一个的关系
     *
     *
     *
     *
     *
     *
     *
     *
     *
     * @param args
     */
    public static void main(String[] args) {

    }



}
