package com.liyafeng.video.game;

public class Game {


    /**
     * 游戏引擎，
     * 游戏引擎是指一些已编写好的可编辑电脑游戏系统或者一些交互式实时图像应用程序的核心组件
     * 这些系统为游戏设计者提供各种编写游戏所需的各种工具，其目的在于让游戏设计者能容易和快速地做出游戏程序而不用由零开始
     * -----------------------
     * 我们知道opengl 提供接口来显示图像，理论上所有的效果都可以通过opengl来实现，
     * 但是我们要写很多重复的代码，那么这些游戏引擎 为我们提供游戏开发的库，
     * 能让我们直接调用他们的api来显示一些复杂的图形，而不用我们自己写很多代码去调用opengl
     *
     * 游戏引擎是一个系统，他们可以提供其他的便捷工具，用来处理图像,
     *      不仅仅是图形渲染模块，其中可能包含网络请求模块，声音播放模块
     * ---------------------
     *
     * =================图像引擎和游戏引擎========================
     * 图像引擎又称 渲染引擎”或者“三维引擎
     *
     * 3D引擎的渲染系统通常建立在一套高级图像API之上，诸如Direct3D或OpenGL，
     * 这些API封装了GPU和显卡的部分功能。
     * 下载显卡的驱动，就能使用显卡的全部功能，驱动中提供了opengl的api
     * 但是也可能提供自己特有的一些api来实现一些复杂的效果
     *
     * ========================手机游戏渲染引擎=====================
     * 看开发2d游戏还是3d游戏
     * unity3d ，cocos2d-x ，libgdx
     *
     * =================libgdx===================
     * libgdx库是使用java+c/c++开发而成的
     * 所以我们可以用java代码来开发游戏
     *
     *
     * @param args
     */
    public static void main(String[] args) {

    }
}
