package com.liyafeng.practice.interview;

/**
 * Created by liyafeng on 2018/2/23.
 */

public class InterView {

    /**
     * 面试
     * ======================
     * （hr电话询问基本情况）
     * -------现场----------
     * 自我介绍
     * 知识点问答
     * 项目介绍
     * boss问答
     * hr问答
     * =======================
     * 1.解决问题的能力：问一些没有接触过的难题，看你给出的解决方案
     *
     * 2.考察沟通能力，就是你能不能听懂面试官的问题，还有你的态度，和你表达的要让面试官听懂
     * 这点可以在介绍项目，和自我介绍的时候考察，
     *      或者问一些需求不是很明确的问题，这时你需要
     * 和面试官沟通，你向他提问，这样有利于在需求不明确的时候能及时理解需求
     *
     * 3.学习能力，这点考察一般会问你：
     * 经常看那些网站？看IO大会吗？看哪些人的博客？如何学习新知识的？
     * 最近在看哪些书？关注了什么新技术？
     * 抛出一个新概念，能否用现有的方法类比解决
     *
     * 4.知识迁移能力（举一反三问题）：
     * 其实就是出一个全新的问题，但他可以用旧的问题的解决方法改变一下就能解决
     *
     * -------------------------
     * 你的表达要有条理，列出一二三，表述要清晰，不要忽略前提条件
     * 表述要详略得当，突出重点
     *
     * ============================================
     * 1.面试官关心你问的问题，这样能体现出你是一个什么样的人
     * 比如你问薪资，那说明这个人只在乎薪资，很容易跳槽
     * 所以正确的一般是问现在的团队情况，和项目情况
     *
     * 2.写代码的习惯，如果不注重健壮性，那么会认为你做的项目不够稳定
     * 那么你是一个不靠谱的人。所以手写代码要考虑健壮性
     *
     * 3.问你一道题，条件模糊，你询问条件是什么？然后会问你如果是这个条件会怎么样？
     * 然后你说答案，然后说如果是另个条件呢？
     *
     *
     *
     * @param args
     */
    public static void main(String[] args) {

    }

    /**
     * 介绍一下你最近的项目？里面用到比较深的技术是什么？
     *
     *
     *
     *
    * */
}
