package com.liyafeng.video;

public class Game {


    /**
     * 游戏引擎，
     * 游戏引擎是指一些已编写好的可编辑电脑游戏系统或者一些交互式实时图像应用程序的核心组件
     * 这些系统为游戏设计者提供各种编写游戏所需的各种工具，其目的在于让游戏设计者能容易和快速地做出游戏程序而不用由零开始
     * -----------------------
     * 我们知道opengl 提供接口来显示图像，理论上所有的效果都可以通过opengl来实现，
     * 但是我们要写很多重复的代码，那么这些游戏引擎 为我们提供游戏开发的库，
     * 能让我们直接调用他们的api来显示一些复杂的图形，而不用我们自己写很多代码去调用opengl
     *
     * 游戏引擎是一个系统，他们可以提供其他的便捷工具，用来处理图像
     * ---------------------
     *
     *
     *
     *
     *
     *
     * @param args
     */
    public static void main(String[] args) {

    }
}
