package com.liyafeng.c;

public class Computer {

    /**
     * http://cn.linux.vbird.org/linux_basic/0105computers.php#program_mechin
     * (很棒的网站)
     *
     * 操作系统是计算机系统中的核心软件，它负责管理和控制计算机的硬件和软件资源，
     * 为用户和应用程序提供一个简单、统一的接口。操作系统的主要功能包括：
     *
     * 1. 处理器管理：负责对处理器的分配和调度，以实现多任务处理和多线程执行。
     *
     * 2. 内存管理：管理计算机的内存资源，包括内存分配、地址映射、内存保护和虚拟内存等功能。
     *
     * 3. 文件系统：负责对存储设备上的文件进行管理和组织，包括文件的创建、读写、删除和权限控制等操作。
     *
     * 4. 设备管理：管理计算机的各种硬件设备，包括输入输出设备、网络设备、存储设备等。
     *
     * 5. 用户接口：提供用户与计算机系统交互的界面，包括命令行界面和图形用户界面等。
     *
     * 操作系统在计算机系统中扮演着重要的角色，它为应用程序提供了一个抽象的硬件平台，使得程序员可以更加方便地开发和运行应用程序
     *
     * @param args
     */
    public static void main(String[] args) {

    }
}
