package com.liyafeng.c;

public class Main {

    /**
     * ### C语言
     * =====================计算机历史=======================
     *
     * ================汇编语言 assembly language===============================
     * 控制硬件，是低级语言，直接控制（描述）cpu的运行
     *
     *
     * 机器语言是一串二进制的数字，是cpu可以直接执行的，但是它没有可读性
     * 所以就有了汇编语言，他采用 操作符 操作数 的方式来编写
     * 经过编译器编译后变为机器语言执行。
     * ================================================
     *
     *
     * 像unix，mysql都是c语言编写的，他的速度和汇编语言差不多。
     *
     * @param args
     */
    public static void main(String[] args) {

    }
}
