package com.liyafeng.algorithm.sort;

/**
 * Created by liyafeng on 2018/2/22.
 */

public class N_Sort_HeapSort {


    /**
     * 堆排序
     * ============概念===================
     * PriorityQueue 优先队列，一种数据结构，提供的api有insert和删除最大或者最小的元素并返回值
     * 我们要实现这个数据结构，可以用二叉堆
     * --------------
     * 当一颗二叉树中的节点都大于等于他们的子节点的时候，这个二叉树是“堆有序”的
     * “堆有序”的“完全二叉树”叫做“二叉堆”，“二叉堆”简称为“堆”
     * 堆的有序化：将堆无序的完全二叉树变为堆有序的，叫做堆的有序化
     * 有两种方式，上浮swim和下沉sink
     * -------------------------------
     * 多叉堆：堆有序的完全多叉树
     * ---------------------
     * 优先队列的多向归并：多个优先队列归并为一个优先队列，来自多处的有序流合并为一个有序流
     *
     *
     *
     *
     * @param args
     */
    public static void main(String[] args) {

    }
}
